# Operations

In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [5]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Finding unique values

In [8]:
len(df['col2'].unique())

3

In [9]:
df['col2'].nunique()

3

In [11]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df[(df['col1']>2) & (df['col2'] > 444)]

   col1  col2 col3
2     3   666  ghi

In [20]:
def times2(x):
    return x**2

In [21]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [23]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [25]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df.drop('col3', axis=1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [28]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
df.drop(1)

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [32]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [34]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [36]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [37]:
from sqlalchemy import create_engine

In [38]:
engine = create_engine('sqlite:///:memory:')

In [39]:
df.to_sql('my_table',engine)

In [40]:
sqldf = pd.read_sql('my_table', con = engine)

In [41]:
sqldf

   index  col1  col2 col3
0      0     1   444  abc
1      1     2   555  def
2      2     3   666  ghi
3      3     4   444  xyz